# ==================================================
#                 ИМПОРТЫ
# ==================================================

import os

from dotenv import load_dotenv
from telegram.ext import Application

from commands import register_handlers


# ==================================================
#             ЗАГРУЖАЕМ НАСТРОЙКИ
# ==================================================

# Загружаем переменные из файла .env
load_dotenv()

# Получаем токен Telegram-бота
TOKEN = os.getenv("BOT_TOKEN")


# ==================================================
#            СОЗДАЁМ TELEGRAM-БОТА
# ==================================================

# Создаём приложение Telegram
app = Application.builder().token(TOKEN).build()


# ==================================================
#          РЕГИСТРИРУЕМ ВСЕ КОМАНДЫ
# ==================================================

# Подключаем все команды и обработчики
register_handlers(app)


# ==================================================
#              ЗАПУСК БОТА
# ==================================================

print("🚀 Бот успешно запущен!")

# Запускаем бота
app.run_polling()