# ==================================================
#                 ИМПОРТЫ
# ==================================================

from database import (
    find_user_by_name,
    find_users_by_city,
    find_users_by_job,
)


# ==================================================
#                 ПОИСК ПО ИМЕНИ
# ==================================================

def find_user(name):

    return find_user_by_name(name)


# ==================================================
#                 ПОИСК ПО ГОРОДУ
# ==================================================

def find_city(city):

    return find_users_by_city(city)


# ==================================================
#               ПОИСК ПО ПРОФЕССИИ
# ==================================================

def find_job(job):

    return find_users_by_job(job)


# ==================================================
#             СОЗДАНИЕ СООБЩЕНИЯ
# ==================================================

def make_stats_message(title, data):

    message = f"{title}\n\n"

    for key in data:

        message += f"{key}: {data[key]}\n"

    return message